jmeter-setup/.tests/success/jmeter.log
2026-05-16 00:09:41,506 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-05-16 00:09:41,536 INFO o.a.j.JMeter: Loading user properties from: /opt/jmeter/bin/user.properties
2026-05-16 00:09:41,538 INFO o.a.j.JMeter: Loading system properties from: /opt/jmeter/bin/system.properties
2026-05-16 00:09:41,551 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-05-16 00:09:41,552 INFO o.a.j.JMeter: Version 5.6.3
2026-05-16 00:09:41,553 INFO o.a.j.JMeter: java.version=21.0.10
2026-05-16 00:09:41,553 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-05-16 00:09:41,554 INFO o.a.j.JMeter: os.name=Linux
2026-05-16 00:09:41,554 INFO o.a.j.JMeter: os.arch=amd64
2026-05-16 00:09:41,555 INFO o.a.j.JMeter: os.version=6.6.87.2-microsoft-standard-WSL2
2026-05-16 00:09:41,556 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-05-16 00:09:41,556 INFO o.a.j.JMeter: java.awt.headless=true
2026-05-16 00:09:41,557 INFO o.a.j.JMeter: Max memory     =1073741824
2026-05-16 00:09:41,557 INFO o.a.j.JMeter: Available Processors =12
2026-05-16 00:09:41,574 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-05-16 00:09:41,575 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-05-16 00:09:41,576 INFO o.a.j.JMeter: JMeterHome=/opt/jmeter
2026-05-16 00:09:41,576 INFO o.a.j.JMeter: user.dir  =/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/ai_agent/.tests
2026-05-16 00:09:41,576 INFO o.a.j.JMeter: PWD       =/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/ai_agent/.tests
2026-05-16 00:09:41,577 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: Tabish FullName: Tabish.localdomain
2026-05-16 00:09:41,600 INFO o.a.j.s.FileServer: Default base='/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/ai_agent/.tests'
2026-05-16 00:09:41,604 INFO o.a.j.s.FileServer: Set new base='/mnt/c/NonStop/Meetups/QA_Agentic_AI_Hackathon/ai_agent/.tests'
2026-05-16 00:09:41,865 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-05-16 00:09:41,908 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-05-16 00:09:41,913 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-05-16 00:09:41,917 INFO o.a.j.s.SaveService: Loading file: simple_test.jmx
2026-05-16 00:09:43,081 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 00:09:43,082 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 00:09:43,082 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 00:09:43,083 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-16 00:09:43,083 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-05-16 00:09:43,083 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-05-16 00:09:43,097 INFO o.a.j.JMeter: Creating summariser <summary>
2026-05-16 00:09:43,128 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-05-16 00:09:43,130 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-16 00:09:43,130 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-16 00:09:43,136 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-05-16 00:09:43,136 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-05-16 00:09:43,246 INFO o.a.j.JMeter: Running test (1778870383246)
2026-05-16 00:09:43,277 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Users
2026-05-16 00:09:43,278 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group Users.
2026-05-16 00:09:43,279 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-05-16 00:09:43,280 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=5 delayedStart=false
2026-05-16 00:09:43,290 INFO o.a.j.t.JMeterThread: Thread started: Users 1-1
2026-05-16 00:09:43,291 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-05-16 00:09:43,292 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-05-16 00:09:43,315 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = Tabish
2026-05-16 00:09:43,325 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-05-16 00:09:43,327 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-05-16 00:09:43,328 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-05-16 00:09:43,328 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-05-16 00:09:43,329 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-05-16 00:09:43,485 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2026-05-16 00:09:43,504 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2026-05-16 00:09:43,505 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2026-05-16 00:09:43,786 INFO o.a.j.t.JMeterThread: Thread started: Users 1-2
2026-05-16 00:09:43,908 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2026-05-16 00:09:43,918 INFO o.a.j.u.SSLManager: KeyStore created OK
2026-05-16 00:09:43,919 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2026-05-16 00:09:44,285 INFO o.a.j.t.JMeterThread: Thread started: Users 1-3
2026-05-16 00:09:44,787 INFO o.a.j.t.JMeterThread: Thread started: Users 1-4
2026-05-16 00:09:45,282 INFO o.a.j.t.JMeterThread: Thread started: Users 1-5
2026-05-16 00:09:45,782 INFO o.a.j.t.JMeterThread: Thread started: Users 1-6
2026-05-16 00:09:46,281 INFO o.a.j.t.JMeterThread: Thread started: Users 1-7
2026-05-16 00:09:46,781 INFO o.a.j.t.JMeterThread: Thread started: Users 1-8
2026-05-16 00:09:47,281 INFO o.a.j.t.JMeterThread: Thread started: Users 1-9
2026-05-16 00:09:47,780 INFO o.a.j.t.JMeterThread: Thread started: Users 1-10
2026-05-16 00:10:00,042 INFO o.a.j.r.Summariser: summary +    135 in 00:00:17 =    8.0/s Avg:  1049 Min:   897 Max:  2293 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2026-05-16 00:10:13,295 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-8
2026-05-16 00:10:13,299 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-8
2026-05-16 00:10:13,339 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-5
2026-05-16 00:10:13,340 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-5
2026-05-16 00:10:13,413 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-6
2026-05-16 00:10:13,414 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-6
2026-05-16 00:10:13,437 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-10
2026-05-16 00:10:13,438 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-10
2026-05-16 00:10:13,722 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-3
2026-05-16 00:10:13,723 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-3
2026-05-16 00:10:13,897 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-2
2026-05-16 00:10:13,899 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-2
2026-05-16 00:10:13,905 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-9
2026-05-16 00:10:13,907 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-9
2026-05-16 00:10:14,043 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-1
2026-05-16 00:10:14,043 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-1
2026-05-16 00:10:14,237 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-4
2026-05-16 00:10:14,238 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-4
2026-05-16 00:10:14,384 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-7
2026-05-16 00:10:14,385 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-7
2026-05-16 00:10:14,386 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-05-16 00:10:14,391 INFO o.a.j.r.Summariser: summary +    134 in 00:00:14 =    9.3/s Avg:  1046 Min:   882 Max:  3090 Err:     0 (0.00%) Active: 0 Started: 10 Finished: 10
2026-05-16 00:10:14,392 INFO o.a.j.r.Summariser: summary =    269 in 00:00:31 =    8.6/s Avg:  1048 Min:   882 Max:  3090 Err:     0 (0.00%)